In [2]:
import pandas as pd

In [37]:
df = pd.read_csv("./data/zippedData/title.ratings.csv")
df.head(10)

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21
5   tt1069246            6.2       326
6   tt1094666            7.0      1613
7   tt1130982            6.4       571
8   tt1156528            7.2       265
9   tt1161457            4.2       148

In [40]:
column = df["numvotes"]
max_value = column.max()

print(max_value)

1841066

In [ ]:
#For the top 10-15 grossing, they have that foreign gross data, we want them, then drop the rest

In [ ]:
### powerpoint by thursday
## visualizations
### finalize visualizations by tomorrow evening - DONE
## make the images live in an image folder
### by thursday throw images onto slideshow - that's the goal
### make sure you do markdown,too
## present Friday morning
# target jupyter notebook for coder
# presentation for noncoder, dummy
## one person insert everyone's into the same notebook

In [ ]:
#from the aborted regraphing:

In [ ]:
genretable = pd.read_csv('data/zippedData/imdb.title.basics.csv.gz')
genretable

In [ ]:
df_meg = pd.merge(df, genretable, how='inner', left_on='title', right_on='primary_title')
df_meg.head()

In [3]:
basics = pd.read_csv('data/zippedData/imdb.title.basics.csv.gz')
basics

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
...,...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,NaN
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary

In [12]:
basics_new = basics.sort_values('start_year',ascending = False)

In [14]:
basics_new.dropna

<bound method DataFrame.dropna of             tconst                              primary_title  \
89506    tt5174640                                  100 Years
96592    tt5637536                                   Avatar 5
2949    tt10300398                    Untitled Star Wars Film
52213    tt3095356                                   Avatar 4
105187   tt6149054  Fantastic Beasts and Where to Find Them 5
...            ...                                        ...
74712    tt4264626             Civil War Life: Shot to Pieces
14471    tt1716746                Heinrich Kieber - Datendieb
74692    tt4263706                       Mushrooms of America
118065   tt7059624                                     Zamana
94000    tt5475580                           A Boy and A Girl

                                   original_title  start_year  \
89506                                   100 Years        2115
96592                                    Avatar 5        2027
2949                      Untitled Star Wars Film        2026
52213                                    Avatar 4        2025
105187  Fantastic Beasts and Where to Find Them 5        2024
...                                           ...         ...
74712              Civil War Life: Shot to Pieces        2010
14471                 Heinrich Kieber - Datendieb        2010
74692                        Mushrooms of America        2010
118065                                     Zamana        2010
94000                            A Boy and A Girl        2010

        runtime_minutes                        genres
89506               NaN                         Drama
96592               NaN      Action,Adventure,Fantasy
2949                NaN                       Fantasy
52213               NaN      Action,Adventure,Fantasy
105187              NaN      Adventure,Family,Fantasy
...                 ...                           ...
74712              79.0                   Documentary
14471              52.0                   Documentary
74692              46.0  Adventure,Comedy,Documentary
118065            140.0                         Drama
94000               NaN                       Romance

[146144 rows x 6 columns]>

In [15]:
basics_new

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
89506,tt5174640,100 Years,100 Years,2115,NaN,Drama
96592,tt5637536,Avatar 5,Avatar 5,2027,NaN,"Action,Adventure,Fantasy"
2949,tt10300398,Untitled Star Wars Film,Untitled Star Wars Film,2026,NaN,Fantasy
52213,tt3095356,Avatar 4,Avatar 4,2025,NaN,"Action,Adventure,Fantasy"
105187,tt6149054,Fantastic Beasts and Where to Find Them 5,Fantastic Beasts and Where to Find Them 5,2024,NaN,"Adventure,Family,Fantasy"
...,...,...,...,...,...,...
74712,tt4264626,Civil War Life: Shot to Pieces,Civil War Life: Shot to Pieces,2010,79.0,Documentary
14471,tt1716746,Heinrich Kieber - Datendieb,Heinrich Kieber - Datendieb,2010,52.0,Documentary
74692,tt4263706,Mushrooms of America,Mushrooms of America,2010,46.0,"Adventure,Comedy,Documentary"
118065,tt7059624,Zamana,Zamana,2010,140.0,Drama
94000,tt5475580,A Boy and A Girl,A Boy and A Girl,2010,NaN,Romance